import arabicProcessingCogStemmer


# string = 'فعل مفعل مفعلون مفعلين مفعلان مفعول مفعلة مفعال مستفعل مستفعلات مستفعلون متفاعل متفاعلات مفاعل مفاعلون مفاعلات مفاعيل افعل افعلاء افتعل افتعال تفاعل تفاعلان تفعلين تفعلون تفعلن تفعيلات فاعل فاعلان فعائل فعال فعالة فعالتان فعالى فعلى فعلي فعول يفعل يفعلان تفعلان يفعلون'


string = ' مفعل افعل فاعل فعال فعلى فعلي فعول يفعل ' + 'مفعول مفعلة مفعال مفاعل افتعل تفاعل تفعلن فعائل فعالة فعالى' + \
    ' مفعلون مفعلين مفعلان مستفعل متفاعل مفاعيل افتعال تفعلين تفعلون فاعلان يفعلان تفعلان يفعلون ' + \
    ' مفاعلون مفاعلات تفاعلان تفعيلات فعالتان ' + \
    'مستفعلات مستفعلون متفاعلات'

string = 'قريب'

string = 'وَقَفَ الطُّلابُ في صُفوفٍ مُرَتَّبَةٍ، ثُمَّ خَرَجوا إلى حَقْلٍ قَرِيبٍ. أَخَذوا مَعَهُمْ غِراسَ التّينِ والخَوْخِ، حَفَرَ الطُّلابُ الأَرْضَ وَزَرَعوا الغِرَاسَ، ثمَّ سَقَوْها المَاءَ. عادَ الطُّلابُ إلى المَدْرَسَةِ مسرورين.'

stems_list = arabicProcessingCogStemmer.root(string)

file = open('output5.txt', 'w+', encoding="utf-8")

for word in stems_list:
    file.write(word + '\n')

file.close()
